{"id": "w4anCL9HJ6k", "title": "You CAN Script. Let me PROVE IT to you.. (Part 2)", "channel": "script_ing", "views": 31638, "duration": "27:12", "url": "https://www.youtube.com/watch?v=w4anCL9HJ6k", "query": "roblox scripting tutorial", "transcript": "you can script. Even if you think you can't, you can. And in this video, I'm going to prove it to you again. Now, if you haven't seen part one of this video series, then please pause this video and go view that video. Just like in part one, I'm going to teach you some stuff and then I'll give you some quizzes to prove that you can do it, even without me telling you step by step. Now, as I teach you more and more stuff, the quizzes will get harder and harder. Just know that I believe in you. And as long as you watch the entire video and don't skip around, you will understand it and everything will be okay. Every time you get a quiz right, you get one point. And there are five points in total. Let's see how many points you can get by the end of the video. Once again, welcome to my channel. My name is Kushall. I've been scripting for almost 10 years now. I've contributed to over 70 million visits for several front page games, and you can see all of the games that I've worked on over the years over here. I also have games of my own, like this one, which is called Elemental Adventures, and is coming out sometime this year. And my mission is to teach you Roblox scripting in a fun way that helps you learn scripting so that one day you can also make your own awesome games. All right, so first let's get rid of the spawn location because it's going to cause issues. So you can just rightclick it on your explorer and then click on delete. And let's warm up with a quick review. All right, so here's a warm-up. I want you guys to create a red ball. So, it's going to look just like this. And I want you to do it using the script. So, you're going to inside of server script service, click on the plus sign, click on script, and then I want you to type the code out here that tells Roblox to create this ball. Now, if you've watched part one of this series, then you should know how to do this. Even if you've watched it and you forgot, then please feel free to just pause this video and then check out that video, relearn what you have to learn, and then come back to this video. So, you're just going to create this red ball and you're going to make this script do it. And I'm going to count to five and then I'll show you the solution. So, just pause this video, go ahead and do it and then come back. Ready? 1 2 3 4 5. All right. So, if I wanted to script this ball, I would go into here and then I'd start scripting local part equals instance new part workspace. So, remember this thing right here? This means create a new part and put it in workspace. Now, why did we say workspace? Because we want the part to go in workspace just like the ball is. So, this ball is inside of workspace. That's why we put workspace here. Why did we put part here? Because this ball is actually a part as you can see. And then to make this part into a ball, we're going to say part.shape equals ball. And then we want this thing to be red. And then notice that part. brick color. So the brick color of the part is set to really red. So I would type part dot brick color equals brick color new really red. Just like that. It's going to create the part, make it a ball, and then make it red. So now if I delete this, I'll go back into home and click play. Boom. There it is. There's my red part. And yeah, I can actually move it around. Now your code might look different than mine, and that's okay. So maybe you called this something different. Maybe you put the brick color over here and the shape over here. That's okay. As long as you got this right here. As long as you were able to produce this. That's okay. So nice job. You finished the warm-up. Unfortunately, the warm-up doesn't give you points. So now we're going to actually start learning. All right. So in the previous video of the series, we talked about how you can get this part to move around, right? So we had this position right here. And then we talked about how we can do like part.position equals vector 3 new and then we said like okay what if we wanted to put it in the sky then we can do that and then when you ran it the part would actually spawn all the way in the sky it's going to it's going to hit me. So we already know about this and position remember that position required a vector 3 new this thing basically just means it needs three numbers. So we gave it three numbers. Now, now let's talk about size. So, here's your part and we can actually do other things with this vector 3 new thing. So, we use vector 3 for position. We can actually also use it for something called size. Now, what do you think size is? It's literally how big this thing is, right? So, right now the size is 4 um 1.2 comma 2. What if I set this to like 7, 7, 7? Well, there you go. Now it's bigger. And now we need to figure out how we can tell this script to set the size to that number. Here's how we would do it. You'd say part size equals vector 3 new. Remember vector 3 new. This basically just means I'm about to give you three numbers. And then we said 7, 7, 7. So create the create the part, make it into a ball, make it red. And now we're finally learning about size. So this is how you can make things bigger. So now when you actually run this or play it, you'll see that you told Roblox to make this part into a bigger part. And now you should have this giant ball that you can just push around a lot harder to get this ball rolling than the other one that was smaller because this part is bigger. All right. So now I think that I want to make this shape into a block. Now, how did I know to type block here? Because whenever you create a part, you can see that one of the properties of this part is shape. And then one of the shapes that you can use is block. So that's how I figured out that I had to put block there. So this thing came from over here. So you can set the part.shape to a ball, a block, corner wedge, cylinder wedge, whatever. I'm using block for this video. So now if I click on play, you'll notice that now it's a giant cube. And you can't really move it around because it's a cube. Well, you can, but it's harder. As you can see, I'm trying to shove it. Okay. All right. All right. First quiz. So, right now, the part size is 7 by 7 by 7. So, that's why it's a cube, right? I want this part size to be two times bigger. So, instead of 777, I want it to be bigger. Two times bigger. So, think about what that means. Okay. So, here's a hint. You need to change these numbers to something. Make it two times bigger. That's the first quiz. I'm going to give you 5 seconds. You got this. Just pause the video. Try it out. Just make this part two times bigger. 1 2 3 4 5. All right. Here's how you do it. So, part size equals vector 3. 777. That's the original size. If I want this to be two times bigger, guess what I have to do to these three numbers? I just have to make them two times bigger. Right? So this seven becomes a 14. This seven becomes a 14. And this seven becomes a 14. And then suddenly when you play, you should see that you have this giant even bigger part. Now it's even harder for me to move. I don't even Oh, I can move it. As you can see, I'm slowly just shoving this part. I'm trying to get it to move. Now there you go. Hopefully you got the first quiz correct. So wait. So yay. So that's how you do it. You just have to basically multiply each number by two. All right. All right. Awesome. Awesome. So now I want to talk to you about material and this is going to be really cool. So stay with me. Okay. Here is the part. Now if you look inside of this part, you can see there's something called material. This is going to look really cool. Ready? Watch. Watch. So you can actually set the material to all of these different things here. You can basically choose one of these things and you can set the material to anything you want. So like for example, I can set it to brick. And you can see now it's a red bricky part. And then I can also set this to like carpet. And now it's more of a carpet theme. And there's all of these things that I can set it to like mud. And that's what a red muddy part looks like. Now, how can we do that using a script? Well, it's pretty simple. It's just like shape. Part do material equals and then you put whatever material you want. So like for example, maybe I want it to be brick part. I just type in brick. Now, make sure that you spell it correctly. So, inside of part material, there's all of these things you can choose. Just make sure you spell it correctly. So, now when you run this, you can see that Roblox made your part into a red giant brick part. All right. All right. All right. Cool. Cool. Cool. Now, right now, this part is actually a giant cube. I want this part to become a wall. And the way I'm going to do this is if you just click on your part, look at your size. Notice that the x, y, and z are the same exact number. So, if you've ever like in math class, you know how they'll teach you about like length, width, and height. That's what these three numbers mean. If I want this thing to be a wall, then I have to shorten one of these numbers. So, maybe I'll shorten this Z to like two, and now it's a wall. So, 1442. That basically means the Y14 is the height. The X14 is like the length of this, and then the Z2 is the length of that. So that's how we were able to make a wall. We just had to set this Z to a two and then we've made a wall. Now in a script, you can basically do the same thing where you set this 14 to a two. So we have the X is 14, the Y is 14, and the Z is two. And now you have boom, a brick wall. You can try to push it around. It's pretty sturdy. All right. Now, if you've been enjoying this whole You can script series, then you will literally fall in love with this book that I have written specifically for you. This book is the best Roblox scripting book you're going to find online right now in this planet on planet Earth. I don't know about Mars, but on Earth, this is going to be the best Roblox scripting book that you have ever found yet. This book will teach you how to script in an easy to understand way. So, there's vocabulary list so that you don't forget what you've learned. There's also quizzes so you can practice what you've learned. There's also lines of code with complete explanations so that you can remember everything and easily understand it. So, if you're interested in this book, make sure to check the link in the comment. This book has already been read hundreds and hundreds of times by people all over the world. There's many, many copies of this book all circulating throughout the United States right now. And if you haven't gotten this book already, you are missing out on a lot of easy to understand explanations just like what I've been doing in these videos. So, make sure to check the link in description and you can get yourself your own copy of this book. All right, ready for quiz number two. So, we now know how to make a wall. We now know how to make it red. And we also I mean, we've already known how to make it red, but now we know how to make the material into a brick. So, now let's say that I want you to create a sand wall. So, maybe you like Naruto, maybe you like uh playing with like elemental attacks or whatever. Maybe your game is like an elemental game. Maybe it's a fantasy game. Or maybe someone hired you and they said, \"Hey, can you make a sand wall for me using scripts and that's what you're going to do?\" So, this is quiz two. I want you to create this using your script. So, edit whatever you have to edit here. Here, I'll give you some hints. The brick color is set to that thing right there. It's called cork. Make sure you spell it correctly. The material has changed. Notice that. And then the size is the same as we had before on our wall. So figure out what you have to change here in order to get this thing. So just pause the video. I'm going to count to five. You can take as long as you need. I'm just going to count to five and then continue. So pause the video. You got this. Just remember cork and sand. And that's about it. That's all you need. Just change this script in a way where it creates this and then I'll give you the solution. Ready? I'm going to count to five. So, 1 2 3 4 5. Okay, hopefully by now you've already paused the video. You've already created this or you've tried to. Here's how I would do it. So, notice that the only things that we need to change are the cork, the brick color, and the material, which is going to be sand. So, part.brick color was really red. Now, part brick color has to be cork. And then the material was brick, but we want the material to be sand. So, we're just going to set this to sand. And I'm going to get rid of this. And now my script is going to create it for me. And as you can see, we got the same exact result, a sand part. And this is like a sand wall. So maybe this is like for an elemental game. So here's your sand wall that you've created. Nice job if you got this correct. This is your second point, assuming that you already got the first point correct. So there you go. All right. So now I'm going to give you a hypothetical scenario which is going to look amazing. Okay. So so far we know part size it requires three numbers. This two right here is the depth. This 14 right here the middle number is the height. Now what if I wanted this sand wall to grow? Wouldn't it seem, you know, probable if what I did was we started at one and then we went so we started at one and then we set the middle number to two and then we set the middle number to three and then we set the middle number to four and then we set the middle number to five and then we just kept on going like this where we just increased it one by one by one like this. Wouldn't it make like a cool animation? Like this is like frame by frame thinking. So like it just keeps on increasing by one like that. And then finally once it gets to maybe let's see how long it takes. Okay. So finally at 14 it stops. Wouldn't that seem cool? It would look like a wall is being made. Wouldn't that seem like really cool? Actually it would. Right. And that was pretty simple. All we did was we made this one and then we made it two. All we're doing is just changing the middle number and increasing it by one every single time. Now, couldn't we do that using code? Yes, we can. And here's how we would do it. So, what I'm actually going to do is I'm going to take this part size. I'm going to move it here. And this is just so it's easy to um explain it, but you guys can do whatever you want with your code. But basically what we did was we said okay let the part size be one and then let the part size be two and then we said let the part size be three and then we said let the part size be four and then we said let the part size be five and we literally just kept on going like this where we increased it right so I'm just going to copy and paste it a whole bunch of times and then we said okay 6 okay 7 okay 8 9 10 11 and and we went all the way until 14 13 14 and all we were doing is we increased the middle number. Now, of course, there's a better way to do this, which I'm not going to teach in this video, but I will teach you probably in a later video because this is right now this is made for like absolute beginners. So, if you're watching this video, you're probably like an absolute beginner. So, here's how it's done. So, what we literally did was we're making like an animation for the wall where we just kept on increasing that Y number until it got to 14. Now, the problem with this is that it's going to increase it all instantly. Like literally, you won't like you will literally just see the completed wall. Like, so if you just run this, right? Boom. You'll literally just see the completed wall. Like, you won't see the frame by frame thing. And that's because we need to tell Roblox to wait a little bit. So, we need to tell Roblox to wait for a few seconds before it does the next thing. So it does this thing, waits for a few seconds, it does this thing, waits for a few seconds, it does this thing. And the way we do it in Roblox is we say task.we. So this task wait here, whatever number you put in here is how long Roblox will wait until it goes to this line of code. So it does this thing and then waits a little bit and then does this thing. And how long we want it to wait, maybe we want it to wait 1 second for now. So it starts out with the size being 1412. that it's going to wait 1 second. And now it's going to be 1422. It's going to wait 1 second. And we're literally just going to spam this. So I'm literally just going to spam this test. So I'm just going to spam it. So every single time it's going to wait 1 second, get a little bit bigger. Wait 1 second, get a little bit bigger. Hopefully you guys can see this, right? All we're doing is just increasing the Y number. So we're going 1 2 3 4 all the way down to 14. So set the size to 1412. Wait 1 second. Now 142. Wait one second. 1432. Wait one second. And that idea is what's going to get us to this cool animation that you see here. And now your sand wall is being built. Doesn't that look awesome? And you can see it's just it's going to take like 14 seconds, but it's just slowly being made. This is the basis for how your favorite games like Battlegrounds or like whatever games you guys play nowadays, anime games, uh any games that use like VFX, this is kind of like the basics for how this is the basis for how those games do that. Now, what if we want it to be faster? Well, we could decrease this number, right? So, instead of waiting 1 second, maybe we wanted to wait 0.1 seconds. So, wait 0.1 second. Wait 0.1 second. And that's going to make the animation happen a lot faster. So, I'm just replacing all the ones with 0.1. Now, when I run this, well, that was pretty quick, wasn't it? So, here's another thing we would do. We could put a task. In the beginning, so now we're telling Roblox, wait 3 seconds and then make your part and then do all the cool stuff with it and then do all of the animation with it. So, this just means wait 3 seconds and then do everything. This is just going to allow us to actually see our animation. So, now whoa. And there's our wall right behind us. Now, here is the next quiz. So, this is going to be easy for you if you got the previous quiz correct. I want this part. So, I decided I don't want sand. I decided I want ice. So, think about what you have to change here. So, instead of making it a sand wall, I want it to be a an ice wall. So, what do you have to change here to make the part into an ice wall? There's two things you have to change. The same two things as the last quiz. For brick color, you can use whatever color you want that resembles like an icy kind of theme. And then for material, think about what you have to change to get it to become an ice wall. So, I'm going to count to five. So, just pause the video. Go ahead. Turn this into an ice wall. Here we go. So, one, two, three, four, five. All right. So, hopefully you guys have your ice wall. Here's how I would do it. So, I'd go click play. So, here's my sand wall. And if I go into this part, you can see the material. You can actually set it to ice. And then you have to set the brick color into some blue color that you like. So, I actually like this color right here, pastel blue. So, I'm going to stop this and go over here. brick color new pastel blue and then set the material to ice. And now 3 seconds later, you will have an ice wall as you can see. So hopefully you got this correct and congratulations on getting it correct. If you did, if you didn't, that's okay. We're still learning. And this is how you can make an ice wall. You can actually move it around. Oh, it's actually pretty slippery. Look at this. So here's what we're going to do for the next quiz. So just follow me. We're going to first start by making this parts brick color into a red color. So in workspace, you should have yourself a part that is red. All right. So now I want you to code it so that after 3 seconds, this part changes from red to blue. So just do that. After 3 seconds, we just want it to change from red to blue. So just pause the video, try to figure it out on your own, and then I'll help you after. So this should be easy. Think about what we just did. Think about how you can do that. So, 3 seconds later, just make the part go from red to blue. So, I'm going to count to five. Make sure you pause the video and go ahead and try it on your own. So, 1 2 3 4 5. All right. So, right now it's red and we want it to change to blue after 3 seconds. So, we're going to do task that wait three and then set the brick color to blue. So, now we're going to click on play. And now after 3 seconds, this thing should change its color to blue. And there you go. All right. So now for the last part of this video and the last quiz, I want to talk to you about a new instance. So so far, so far we've been doing things with instance. So so far we've been doing global part equals instance new part workspace, right? So this right here just means to create a part. And this part right here is a type of instance. So this is like a thing that you can create, right? And guess what? Fire is fire is also another thing that you can create. So this line of code creates the part and puts it in workspace just like this. But did you also know that you can also do the same exact thing with a different instance? So this is part we can actually do the same thing with fire. So local fire. So remember this part right here is I'm telling Roblox I want to create a new variable called fire. And then I'm gonna say let that fire variable be equal to that thing right there. So this part creates the part puts it in workspace. And then this part creates fire. And instead of putting the fire in workspace, now we're actually telling Roblox put it inside of the part. And guess what this is going to do here. This this isn't the last quiz. So this isn't the last quiz, but I kind of want you to guess like what do you think this is going to do? So, we create a part and then we put fire onto that part. So, pause the video, try to explain it to yourself. This isn't the quiz, but try to just explain it to yourself. What do you think this is going to do? So, I'll give you 5 seconds. So, 1 2 3 4 5. Okay. So, if you guessed that this code is going to put fire on the part, so it's going to basically create a flaming part, then you're correct. And nice job. So now I'm going to play this and you'll see now the part is on fire. So this is actually really fun. Now we've got a flaming part. And now what we're going to do is I want this to be like a meteor. So what we're going to do is we're going to say part dot um let's do part material equals neon. So neon this is actually a material that basically makes this part glow. So this is just a neon material. This is actually one of my favorite materials. This basically just makes it glow. And then we're going to say part.brick color equals brick color. red. So now we're creating a neon red part. And then we're going to set the shape to a ball. Do you see where we're going with this? We're actually going to make meteors. So now we've got ourselves a red glowing ball. And we've also added fire onto our ball. And guess what that does? It creates a meteor. And for the last part of this video, remember how in part one we created like we made 200 falling red balls from the sky? Guess what we're going to do now? In part two, we're going to create 200 falling red meteors from the sky. And that's going to be your last quiz. So, you're welcome to look at how we did it in part one. This is a pretty easy quiz. So, all you have to do is basically just make this thing fall from the sky. Make it happen 200 times. So 200 meteors are going to fall from the sky and you can just make them all fall from the same position and that's it. So I'm going to give you 5 seconds. So you can pause the video, try it out. You're welcome to like use Google, you can look at the previous part of this video series and just try it out. Okay? So 1 2 3 4 5. All right? Let's see how well you did. So this is our first part. Now I'm going to show you the solution to this final part of this video. the final quiz of the final quiz of this video. And what we're going to do is we're basically just going to get this thing to fall from the sky. We're going to get 200 of them to fall from the sky. So this part creates the whoop this part creates the flaming red ball. We want 200 of them. So we need to surround it with a for loop. For i= 1 200 do that means to do it 200 times. Then what are we trying to do 200 times? We're trying to do all of this 200 times. So this part means do it 200 times. This part creates the ball. This part puts fire on the ball. And then this part means to stop doing it. So it basically everything between this and this which is this will happen 200 times. So this is going to create 200 balls. And you'll see that it does create 200 balls. Oh. Whoa. Whoa. This is it's actually pretty funny. Okay. Now, we've created our 200 balls, but we want them to all fall from the sky. And so, we need to do we need what we need to do is we need to part.position equals vector 3 new zero. And then maybe I'll drop it like 500 studs above the ground. So, this means 500 studs above the ground. And then we're going to set part.edor to false. And then part collide to true. So create the part, make it neon, which makes it glow, make it red, turn it into a ball, and then basically move it to the sky. That's what this does. This means move it 500 studs above the ground. And then make sure it can fall. And then make sure that it can touch other things because it's going to be like a meteor. And then this part creates the fire. So now when I run this, you'll see we now have I think it bounced. We have 200 falling red balls, but they're actually all like I think they all fell in the same exact position. And so if I drag this out, you can see there's actually two Oh my goodness, there's 200 of these balls. So hopefully if you were able to get this far, then congratulations. You have unlocked the final point of this video. And I hope that you'll stick around and subscribe and you'll be able to wait for part three. And then when that's out, hopefully you'll get all the points in part three and then part four and part five. And you can see where I'm going with this. I'm going to make a whole bunch of parts for this video series because I know that you guys love this video series so much. So, thank you for watching and remember to subscribe and I'll see you in the next video. And enjoy your 200 flaming meteors.", "scraped_at": "2026-01-08T15:05:06.401492", "error": ""}