{"id": "-QSmtYVMRH4", "title": "How to make your FIRST Roblox Game in 2024-2025 (Make Robux)", "channel": "CodeBro29", "views": 2207521, "duration": "29:49", "url": "https://www.youtube.com/watch?v=-QSmtYVMRH4", "query": "roblox scripting tutorial", "transcript": "By the end of this video, if you follow all the steps that I'm going to be showing you, you will learn how to make this game by yourself. You're going to learn how to make an obby, and you're going to learn how to make Robux with this obby by adding a skip stage button where people can actually purchase this from you. And once they purchase it, they will actually get skipped to the next stage and you can earn Robux that way. Let's not waste any time. Let's just jump right into this. Enjoy, guys, and good luck. All right. To get started on your game making journey, you're going to have to go to roblox.com/create and you're going to be brought to this page. After that, click this big start creating button and it's going to check to see if you have Roblox Studio. If not, it'll ask you to download Studio. Go ahead and click this button and then move on. Once you've downloaded Roblox Studio, you can go ahead and double tap the app to open it up. And now you should actually be inside of Roblox Studio. I'm going to be showing you some of these windows right now. So, the first one is the new window. This will create new games for you. So you can go ahead and click new and that'll show you all the different templates you can use to create your games. The next one is going to be my games. This tab holds all your current games that you have made. So once you've already made a game, you can check in here to see where those games are. Recent shows you the most recent games you've been working on. After that, there's archive and tour, but we're not going to touch on those. So go ahead and go to the new tab and click this base plate button. That's going to give you a brand new game with a Roblox base plate. First thing we're going to do is learn how to move around and navigate through this 3D space. You can use W and D on your keyboard to move around just like you can in a Roblox game. Next, you can hold right click and move your mouse around, and that'll pan your camera. So, go ahead and hold right click and move your camera, and you can figure out how this camera system works. Takes a little bit of getting used to, but once you figure it out, it's easy peasy. Next, you can move around your mouse and hover over different objects in your game, and you can leftclick to select them. For example, I just selected the spawn location. If for whatever reason that's not working, head up here to this select button. Click that first, and then you can select tools or objects in your game. Okay, the next thing we're going to learn is how to navigate the different tabs. Right now, we are in the home tab, and you can see that up here at the top of my screen. It says home. This has a ton of different buttons. We're only going to get into a few of them. Uh, but first there, let's do move, scale, select, and rotate. If you select a part, you are using the select tool right here. Now, if you switch over to the move tool, you can actually move parts in your 3D world. So, as you can see, there are three different axes that we can move it on. There's the X, the Y, and the Z. So, we can use these arrows to drag around our objects in different dimensions in the three-dimensional world. And you can drag it all around and around and around. Okay. Next is the scale button. You can click that and then click a part. and you're going to see very similar things, but instead of arrows, it's just dots or circles. If you drag one of those, you can see it moves or it resizes it along that axis. So, we can go ahead and resize it this way. We can resize it this way. Okay. And last but not least, we have rotate. If you click the rotate button and you click something, you can rotate your parts. Uh, and you can rotate them whichever way you would like. There again, three ways because this is three dimensions. Okay. If you What if you want to undo all that though? Glad you asked. You can go ahead and hit control or command if you're on a Mac and Z. So you can do that as many times as you need and that will undo what you've done. As you can see, I've just clicked control-z a ton of times and now my spawn location is back to where it started. If you want to redo something, you can either click this arrow right here or you can click control shift Z and that'll redo what you just did. But I'm going to hit control-z again cuz I want my spawn location to stay right here. Next, there's the toolbox. this. If you click this, it'll open up with the toolbox window right here. These are all different free models that people and Roblox have provided uh for you to use in your games. Be careful though, a lot of them have hacks that will ruin your game. So, really be careful with what you choose in the toolbox. Next, we can insert parts. If you click this part right here, you'll see a new part has been added to our game. And we can move this around and around and around. Uh we can also add, if you click this little triangle under the part, you can choose a different part to add. For example, if I want a sphere, there we go. I have a sphere. Now, we can also go ahead and head over to this color right here. If we click this, maybe we want to make the sphere red. So, we can click the sphere, click this color, and change the color to red just by clicking the right color from here. Now, you'll notice if I click it now, it's not going to do anything, and that's because I don't have the sphere selected. Once I click the sphere, then I can change the color. Okay. Uh, after that, let's go ahead and delete these by clicking clicking them and clicking backspace or delete. That will go ahead and delete the parts in your game. The next thing, what if you get a part lost in your game? So, you can actually go ahead and insert another part. And let's say it's way over here and you want to go over to that without having to scroll all the way. Um, or use WD. That's another thing. You can scroll to move faster. If you scroll in, uh, you can move closer. And if you scroll out, you can move further away. But let's say that you're all the way over here and you want to just quickly go over there. Well, you can select it by dragging like a box over the part you want to go to and click F. and that'll focus your camera onto the part that you just selected. Okay, so now that we have all that down, I'm gonna select this part and go ahead and hit backspace again. Okay, another thing that you should know as we are getting into this is how to uh open other windows such as the explorer and properties. So, if you go ahead and hit view right here at the top, you can go ahead and click explorer and properties. Make sure that these two windows are open. You should see explorer and properties. And then let's just quickly go ahead and show you what this does. Uh you can select a part and uh you can find it in the explorer. So if you open up the workspace and you look in here, you should have something called part. You can click that part in the explorer and you can see now it's selected in the game. You can rename that part by clicking the name. And maybe we'll call this uh cube. And there we go. Now we have a part called cube inside of our game. Now if we want to change any of the properties, we can scroll down to the properties tab. So, if you click the part either in the explorer or in your game, you can mess with all these properties. You can change the color this way. You can change the transparency and all that. Uh, there's a lot you can do with this, but I'm just not going to get into that right yet because we're going to talk about that more once we start making the game. Okay, we are going to go ahead and now, as I've said that, start making our game because that's what you guys came here for. So, let's go ahead and now that you know how to move around studio, let's go ahead and make an awesome obby. So, uh, this is going to involve a little bit of scripting, a little bit of building, and, uh, a little bit kind of a little bit of everything. So, let's just go ahead and get started. Uh, and I'm just going to walk you through step by step everything you need to know, and by the end of the game or end of the video, you'll have made the game that I just showed you at the beginning. Okay? So, go ahead and select this base plate in the explorer and delete it. So, uh, if you missed that, make sure you go into the explorer, find this part called base plate, click it, and click backspace. That'll delete your base plate. Now, you can see we just have a spawn point. Okay, I'm going to insert one of those cartoony outlines to our uh our spawn location. So, the way you do that is by selecting the spawn location either in your game or in the explorer tab. Then, you can click this little plus icon right here. And you're going to search for a highlight. That's this object right here. You can go ahead and click that. Next thing to do is click that highlight. And I'm going to go ahead and change this fill transparency to one. That way there's it doesn't make our uh spawn location a weird color. So right here in the properties, fill transparency, set that to one right here. And then you can change this outline color by clicking the color right here and changing it to a black. If you're on a Windows, it might look a little different. And then hit okay. And there you go. Now there's this cartoony outline to your spawn pad. As you can see, it's it's going all the way around. Perfect. So, that's just a little touch to make it look a little bit fancier. Now, let's go ahead and make stage one. So, what I'm going to do is I'm going to insert a sphere into the game. And this sphere is going to be um the uh first object for players to climb on. So, I'm going to go ahead and redo that really quick so you guys can see everything I just did. Go ahead and come up here to the part, click the drop down, and click sphere. Now you have a sphere right here. You can click it and you can move it away from the spawn location. You can also go ahead and scale it and you can recolor it if you want. There we go. The next thing I'm going to do is I'm going to click that and I'm going to click controll D. That will duplicate this part. And as you can see now we have two parts in our explorer. Now we can click this move button and let's just move it out like this. And there we go. Now we have a second sphere. We can recolor this one as well. And we're just going to make a little ball jump obby. Okay. So, let's go ahead and do this again. Crl D to duplicate it. Click the move tool and move it around. Then recolor it. Ctrl D. Move with the move tool and recolor it. Ctrl D. Move with the move tool and recolor it. Okay. So, you may be thinking, I want to test this out. Hold your horses though. We got to fix something real quick. So, if you go ahead and play this game now, I'm just going to show you. Don't go ahead and play it right now. But if you play it right now, you're going to notice that all your spheres are going to disappear. And uh well, where did they go? Turns out they fell. They fell all the way through the map. Um that means that if I go ahead and select these, I'm going to just visualize what happened when I hit play. All these spheres just went boop down. Okay. So, if you want to fix that from happening, you're going to need to anchor these. So you can click each of these parts and you can click this button up here that says anchor or you can scroll down in the properties and make sure anchored is checked. I would personally just go ahead and select the sphere and click this anchor button up here. If you want to select more than one part at a time, you can hold shift. So if I hold shift and I select all three of these now you can see all three of them are selected and I can hit anchor and that'll anchor all these at the same time. Okay, let's go ahead and hit play now. And we should see that the spheres have stayed in the air. And yep, there they are. Right now, uh, we can go ahead and play this game. Let's jump, jump, jump, jump, and jump. Oh, I'm terrible at obies, so I missed that last one. But there you go. There is stage one. Okay. So, uh, we're going to go ahead and do a little scripting, though, because what we want to do is we want to have checkpoints. So, I'm going to insert another part. Uh, we're going to just insert a part. Uh, let's do it the way that we've been doing it. So, click this drop down and click block. Now, let's go ahead and move this to the end of the ball jump and we can go ahead and change the color of this. I'm going to make it a green so that people know this is a checkpoint and I'm going to go ahead and scale it way up like this. Here is our checkpoint. Make sure to anchor it now. And I'm going to go ahead and click it and click the materials right here in the properties tab. Go ahead and click that and select neon. that will make your part glow and people will be able to know, okay, that's my checkpoint. So, let's go ahead and click this part and where it's highlighted in the explorer, let's rename it by clicking the name and naming this checkpoint. Okay, next thing you want to do is click this plus icon on the checkpoint and insert a int value. Okay, so click the the plus, search for int value and insert this by clicking it. Okay, once you have one, go ahead and rename it to stage. Okay, this is going to be the current stage that they're on. So, if they press if they step on this block, we're going to set their stage to be two. So, inside of the properties of this stage, go ahead and set zero to two right here. So, that will mean, okay, once we hit this block, we're going to be on stage two. Okay. Now, because this isn't my beginner scripting series, I'm going to go ahead and do the scripting. And I'll leave the script in the description. So go ahead and what you're going to do is you're going to click this plus on the checkpoint. You're going to hover over our checkpoint, click a plus, and then search for script and insert this one. Not a local script, not a module script, but a regular script. Okay. And then you can rename this if you want. Uh I'm going to rename it to checkpoint script. Totally up to you though. And then I'm going to have this uh code in the description. So this script is going to be in the description. Make sure you look in the description for checkpoint script and then copy and paste this into the script. So go ahead and get rid of the print hello world at the top. The way you would do that is just by selecting it and uh and just clicking backspace. So you can drag your mouse. You can click and drag and then click backspace. Okay. And go ahead and paste this code into the script. Now you can close out of the script by clicking this X right here on the checkpoint script. There we go. Now we're out of the script. The next thing is to add a leader script. Uh, and again, this is going to be down in the description. Just a quick reminder though, if you have any trouble at all with this video or any of the tutorials on my channel, make sure to join my Discord server and ask the community uh how to solve your problem. There's a channel called scripting support and you can add ask any questions in there um or studio support. So, you can ask any questions in there uh and you can help get an answer quick and we can help you with an answer as quick as we can. Okay. Uh go ahead and in your explorer hover over server script service. You'll find it right here. And you can go ahead and click the plus and again add another script. Not a lo local script or a leader I mean a mod module script. You can rename this script to leader stats if you want. And then you're going to paste the second link or second code second script uh into this. So go down into the description and look for leader stats script next. You can paste it here. Okay. Okay. So, go ahead and copy and paste this script from the description into the uh into this new script. Uh and then you can click the X up here to close out of it. Then you can go ahead and hit this play button right here, this blue triangle. Uh it'll be next to your color. And then you can hit play and that'll spawn you into your game. So, let's go ahead and hit play. And as you can see, if you spawn in and you've done everything correctly so far, you should see this up in the corner. You should see your stage right here. And as you can see, it says I'm on stage one. But if we go ahead and complete the obby, if we go ahead and go all the way to the end and step on this, you can see that our stage is going up. Now, you can see that there's obviously a bug right now. I'll have that fixed for you. You guys don't need to worry about that at all. So, um, that should be fixed for you. That's just for me. And just to show you that I was telling the truth, I'm going to go ahead and complete this. And you can see that this bug has been fixed. There you go. Stage two. This should be fixed for you. You can just copy and paste the script in the description like I told you to. And uh there you go. Now, let's go ahead and add some more stages. Um but before we do that, actually, I need to make sure that players spawn where they're supposed to spawn when they die. So, uh let's go ahead. I'm going to go ahead and show you how to do that. Uh it's going to involve another script. So, in the workspace, go ahead and hover over workspace. Click the plus. Okay. And then insert a folder. You can search for that and insert a folder. Name this folder. This is super important. Name this folder spawns. And you can again do that either by clicking the name or you can go into the properties and change the name right here. Okay. The next thing you're going to need to do is click this checkpoint. Click it again. Left click it. And then drag it up to the spawns and then release it once the checkpoint is on top of spawns. That will put the checkpoint right here. This checkpoint inside of our spawns folder. This is super super important. So, make sure that you do that. Uh, and if you didn't get that, just rewatch that part of the video. Um, so make sure you have spawns folder and a checkpoint in there. Okay. Next, insert a script again into server script service. And you can rename this um, respawn script. Again, this will be in the description. Just look in the description for what says respawn script and paste it into here. So, go ahead and paste this code into the script. close out of it again by clicking X and hit play to test out your obby so far. If you go ahead and go past the uh the spheres, you can jump on top of them. And then if we hit the checkpoint, you'll see our stage is up to stage two. We can jump off and once we die, we should respawn on our checkpoint. And as you can see, yep, here I am on my checkpoint. All right, just a quick reminder. If you want to learn how to make these scripts for yourself and make your very very own Roblox games um without having to use YouTube tutorials, uh then make sure to go check out my beginner scripting series. I'll leave that linked down in the description. And uh yeah, it's uh it's hopefully going to be helpful to you. Okay, the next thing to do is to add more stages. So, uh I'm going to go ahead and let you guys go ahead and do this part, but I'm going to show you how. So, remember the toolbox earlier? Go ahead and open up the toolbox and search for obby. Okay. And in here you can see a ton of different options for your obies. Now again I I would be very very very careful with the um obby parts you insert. I would say make sure that when you hover over it, see these this little check mark, make sure that's green and it has a good amount of ratings. That means that a lot of people have uh have liked this and say it's a good model. Okay? Just just to keep you safe. Okay. So, how how can we actually go ahead and insert these? Well, you can go ahead and drag this into here. Okay. And now once you drag it on top of one of your other parts, you can see our our stage is right here. Now, I want to go ahead and move this so it's not in the middle of the other stages. So, I'm going to go ahead and click it. Click the move tool. And we can go ahead and move this out of the way like this. Okay. So, now we have our next stage of our obby. What we're going to do is we're going to click this checkpoint. We're going to duplicate it by clicking control D and we're going to move it to the end right here by clicking move. Okay, the next thing you need to do is to click this checkpoint and drop down. See where it's highlighted in the explorer. So find that. You can open up the spawns folder and open up your checkpoint and then change your stage to be three now. So click the stage inside of this checkpoint. So click the checkpoint, find stage right here, and click uh this value and change the two to be a three. So that'll tell my script that I have written for you guys, hey, now we're on stage three now that we've hit this button. And now you can go ahead and add as many stages as you want. I'm going to go ahead and add about two more. Okay. Now, you're going to get these pop-ups on some of these that say this includes scripts. This can be dangerous. So, if you want to be careful, go ahead and join my Discord server and just like ask, hey, do these scripts look good? Um, but I think some of some of them are okay. So, I'm going to go ahead and insert this one. I'm going to click okay. And I'm going to go ahead and rotate this. If you want to just rotate it 90°, you can hit CtrlR, and that will rotate a model 90° like that. And then we can click the move tool, and we can move it. Perfect. So, now we have our next stage. The next thing I'm going to do is click this checkpoint. I'm going to duplicate it by clicking Ctrl D. And I'm going to move it again. And once again, you need to click the checkpoint. You need to go into here into that checkpoint. Find the stage inside of that checkpoint. And now we're going to change it to four. And you can keep doing this for as many stages as you want. And if I go ahead and hit play, it's going to go ahead and Yep. There we go. So, we can go ahead and jump on these. And we're going to go into stage two. We can go across here. and we're going to get to stage three. Next, we can try and get past this. I'm not good at obies, though, so it probably won't happen. Um, but as you can see, once I die, I respawn at the checkpoint. And everything seems to be working just fine. Okay, perfect. So, and I can make it to Oh, I can't quite make it to the end of my hobby. That's okay. All right, the next thing I want to show you how to do is to make a skip stage button so that you can actually make Robux. But before we do that, I want to ask if this video has been helpful so far, if you would just quickly take a second out of your day to subscribe. It's completely free and you can always change your mind later. Now, let's get back to the video and help you make some Robux. And to do this, you're going to need to join my Discord server. What you're going to need to do is you're going to need to go to the announcements channel and click the pinned link or pinned uh button and then you're going to find the um the developer products script. Okay. So, uh, what we're going to do is we're going to create a, uh, GUI. Also, in my Discord server, I'll just include a file. So, uh, you can just drag that file into the game. So, if you go ahead and download that file from my Discord server, you can find the file on your computer and just drag it into here and it'll create that GUI for you. But if you want to make it by yourself, go ahead and hover over started GUI, click that plus icon, click screen GUI right here, and then you can click frame. Okay, you can move this frame by selecting it right here and um moving it around. Again, I'm do I'm going to do this quickly though because this is going to be available for free in my Discord server. You can move it around to where you like. Then I'm going to go ahead and click uh this make it a darker color like that by changing the background color. You can add a corner UI corner. Oops, sorry about that. UI corner. Click the UI corner and change this eight to be something like 30. That'll round this frame right here. Okay. And now I'm gonna go ahead and insert a text button into there. Text button. Okay. And here you can go ahead and scroll down. Find the size property in properties and change that to be 1, 0, 1, 0. That'll resize the button to fit the entire screen. Next, go ahead and click background transparency. Change that to one. Scroll down in the properties till you find text color. Select that and change it to a white. Hit okay. Next, change the font face to Froooko one right here. And click text scaled. And then we can change the text right here in the properties by and change it to skip stage. Okay. So now we have a skip stage button. I actually think I like it up at the top. So, what I'm going to do is I'm going to go ahead go ahead and copy this again. Um, click your frame. Go down to the properties and click position. And you're going to go ahead and do point uh.5 comma 0 comma.1 comma 0. Actually 0 comma uh no uh that's right anchor point. So you can go ahead and click the frame, go to the properties, and click anchor point and set that to be 0.5 comma 0.5. Okay. And the next thing you're going to do is click the position right here. And you can set that to be 0.5 comma 0 comma 0.1 comma 0. That'll position it right here. Next thing to do is change the size. So click the size and set it to be 04 comma 0 comma 0.15 comma 0. There we go. There is our skip stage button. Uh, and it looks I think it looks fine. So, uh, you can go ahead and insert that. Uh, I'm trying to decide, should I have it on the top or the bottom? Maybe the bottom of the screen. So, I'm going to change this position to be 0.5 comma 0 comma 0.1 or 0.9 comma 0. There we go. Now, we have a skip stage button right here. Next thing to do is click that text label, uh, hover over it, click that plus icon, and click the local script. Okay. In that local script, you're going to paste the next line of code. This will also be linked down in the description. You don't have to join my Discord server for this. That's just if you want the model. Uh, and the model will include this script, by the way. So, if you want to just drag that model into your game, go ahead and join my Discord server and you can find it. But if not, just go ahead and go down to the description and paste this code. So, what you're going to do is you're going to copy and paste the script from the description. Look for uh dev product script local in the description, and you can paste that down there. The first thing you need to do is actually save your game. And this is a good idea to do kind of right away. Should have done this earlier. The way you're going to do this is by clicking file up in the top left. Click file. Click publish to Roblox. Then give it a name right here. We can just call this my first game. Then you can go ahead and click this create button right here. So once you publish it to Roblox, you should see this right here. Uh well, your game. And that means that it has successfully saved to Roblox. So, the next thing to do is open up Chrome or Safari or whatever web web browser you have, and you're going to type in create.roll.com. This is where you can make your developer product so you can actually earn Robux. Next, go ahead and click creations right here on your screen, and then find your game. My I named my game my first game right here. So, go ahead and click that and it's going to bring you to this next page. So, right here on this left side, scroll all the way down until you see uh uh sorry, developer products. Okay. So, go ahead and click developer products right there. And then click create a developer product. Next, go ahead and give it a name. We're going to call this skip stage. And go ahead and set how many how much Robux it should cost. So, we're going to go ahead. I'm going to set mine to be 20 Robux. Really cheap, but uh don't make it too expensive, otherwise people won't buy it. Then click create developer product. Okay. Next, what you can do is you can go ahead and click these three dots and click copy asset ID. You're going to need to do this for this step. So click that. And now let's head back to Roblox Studio. Okay. Once you're back in studio, go ahead and click starter GUI right here. Open up the screen GUI by clicking these triangles and the frame, the text button, and open the local script right here. Then you're going to paste all these zeros. You're going to select all those zeros, delete them, and you're going to paste that ID right there. Okay? So, make sure you copy you. This is your ID that you just copied in the last step. You're going to paste it there in that script where right before it says your ID here. And after you paste that ID right here, you can close out of your script and hit play. And we should actually be able to purchase our item. Okay. So, let's go ahead and come down here, click the skip stage button, and as you can see, it's asking us if we want to skip the stage. Um, just know this is a test purchase. Whenever you do it in Roblox Studio, uh, it won't actually charge your account. So, you can actually go ahead and buy it. But, you're going to notice, okay, it's actually not working. We're kind of scamming players right now. So, let's actually go ahead and fix that so that it teleports players to the next stage whenever they buy this. So to do that, go ahead and again hover over server script service and click the plus and insert a script. And for the last time, you're going to need to copy and paste one of the scripts from the description. Look for developer product server script down in the description and copy and paste that here. Okay, so you're going to go ahead and paste this script. Uh, and what you're going to need to do is you're going to then need to copy your developer product ID again. So close out of the script. Then you're going to scroll down to start a GUI screen GUI frame text button and the local script we were just in. Click this uh copy this number right here by hitting control copy. You can just select all this. Hit Ctrl + C. Then you can close out of the script again. Go to your new script and replace that ID right here, all these zeros with that. Okay, that's all you're going to need to do and you should have this working. I'm going to close out of the script and I'm going to rename this to uh skip stage. Okay, let's go ahead and hit play and test this out. So again, we are in Roblox Studio, so your account will not be charged for these. So you can actually go and test it yourself. Click the skip stage button and you can click this to actually purchase it. You hit okay and wait a couple seconds. And there you go. As you can see, I've just skipped to the next stage. And you can see my stage has also uh been changed up here in the leader stats. Now, really quickly, let's make your game public so that you can actually play it with your friends. Go ahead and head over to create.roll.com. Click this creations tab, and you're going to find your game again. Uh for me, it is my first game right here. You can go ahead and click that. Next, you can go ahead and go to uh settings under configure. Click public. That little dot right here. Make sure it's checked and click save changes. Now you can click overview over here again and then you can click view on Roblox and that'll open up your game in a brand new tab and you can join it here. You can copy this link right here, send it to your friends and you can have your friends join you and that's how you can uh publish it. Now everybody can play your Roblox game. And there you go. That is how you can make your own game. And I've also included how you can make Roblox in it too. If you have any questions, make sure to leave them in the comments below or join my Discord server. And if you want to just download download this entire game for yourself, you can go ahead and uh join my Patreon page. $5 a month that uh that tier will get you this game. Make sure to add as many stages as you want to this. Um all you have to do is just remember to click this checkpoint, your last one, duplicate it, move it, and then open up the checkpoint and change the stage value to whatever stage that starts. Okay. And uh there you go. That is how you can make your very first game in Roblox. Again, if you have any questions, make sure to let me know. Other than that, thank you guys so much for watching. Thank you to Samuel Ramsey and Snorlax for supporting me on Patreon. And uh other than that, I'll see you guys in the in a future video. Make sure to subscribe for more content like this. See you later. Bye, guys.", "scraped_at": "2026-01-08T15:05:18.270508", "error": ""}