{
  "id": 4232004,
  "title": "How do Roblox animations work?",
  "slug": "how-do-roblox-animations-work",
  "url": "https://devforum.roblox.com/t/how-do-roblox-animations-work/4232004",
  "category_id": 55,
  "category_name": "Scripting Support",
  "created_at": "2026-01-08T18:14:19.498Z",
  "last_posted_at": "2026-01-08T19:23:29.355Z",
  "views": 55,
  "reply_count": 0,
  "like_count": 0,
  "tags": [],
  "posts": [
    {
      "id": 13661548,
      "username": "rasfar7",
      "content_raw": "",
      "content_html": "<blockquote>\n<p>Hi,<br>\nI am making a roblox animation plugin.</p>\n</blockquote>\n<p>I’m trying to understand how Roblox animations work beyond just creating and playing them in Studio.</p>\n<p>Could someone explain:</p>\n<ul>\n<li>How <strong>Keyframes / KeyframeSequences</strong> are processed when an animation plays</li>\n<li>How animations affect <strong>Motor6Ds</strong>, and why they don’t seem to affect <strong>Welds</strong></li>\n<li>How the <strong>Animator / AnimationTrack</strong> system applies pose data to a rig</li>\n</ul>\n<p>I already know how to make and play animations, but I want a clearer understanding of what’s happening behind the scenes.</p>\n<blockquote>\n<p>I did read the roblox docs but didnt understand anything.</p>\n</blockquote>\n<p>Thanks!</p>",
      "created_at": "2026-01-08T18:14:19.758Z",
      "likes": 0,
      "post_number": 1
    },
    {
      "id": 13662059,
      "username": "hello2e6",
      "content_raw": "",
      "content_html": "<p>I’m not too entirely sure myself, but If I had to take a quick guess, I’d say that keyframes operate by setting CFrames in the affected joints, limbs, and body parts. Animations probably just set the transform data of an Motor6D. Animators just start the Animation Track which is a sequence of the Keyframes. Roblox probably uses a stopwatch system where the passed for the animation increases by the servers deltaTime. Then when the stopwatch threshold has passed the threshold for the keyframes, it applies the CFrame transformation to the Motor6D. But you also how to consider easing styles.</p>",
      "created_at": "2026-01-08T19:23:29.355Z",
      "likes": 0,
      "post_number": 2
    }
  ]
}