{"id": "foKFpXZYXPk", "title": "How to use module scripts on Roblox", "channel": "Roblox Learn", "views": 84083, "duration": "5:42", "url": "https://www.youtube.com/watch?v=foKFpXZYXPk", "query": "roblox scripting tutorial", "transcript": "Have you ever found yourself copying and pasting a chunk of code from one script to another? Well, what if I told you that there was a better solution to this? Introducing module scripts. Hey there, this is Steven. Let's learn something new. At the core, module scripts allow you to reuse code between different scripts. So, why even care? Well, when you duplicate a piece of your code, it becomes increasingly more difficult to maintain. If you make a change to one duplicate, you need to remember to make a change in the other. What if you forget? Or what if another team member doesn't know to do this? This sounds like a recipe for hard to find bugs. Avoiding duplicate code leads to code bases that are easier to maintain. Okay, so wouldn't you use a module script? Well, essentially, anytime you find yourself duplicating code across various scripts, that's a great time to break the duplicate code out into its own module script. Let's look at an example to learn how to use module scripts. What we see on screen right here is just a little simple windmill spinning around. And if we look inside the script here, we see it's it's quite simple, but I wanted to pay attention to the speed variable here. Right now, it's set to 10. And let's say we wanted to duplicate this windmill a few times. So now we've got a bunch of windmills in our game. But what if we wanted to change the speed? Unfortunately for us, we would have to go through and change the speed variable within each and every windmill script. But let's try to use module scripts to make this a lot easier for ourselves. Under replicated storage, I'm going to create a new module script and name it windmill config. We'll copy that name and we'll change the module variable here to be windmill config as well to match the name. So you can see the core of a module script is simply just a normal script, but it returns a value. And that's the most important part about a module script is that it returns one and only one value. Not zero, not many, just one value. And it can be any value that's valid within Lua. So it could be a number, it could be a string. Most commonly, you're going to see people use tables and functions. In this case, we have a table called windmill config. And inside of this, let's create a variable called speed. And we'll set it to 10, just like we had it set before within our windmill spin script. Now, let's implement this module script into our windmill script. Let's go back to just one windmill and open up the spin script. Again, we see the speed variable there, but we want to replace that and use the windmill config instead. So, in order to grab the value from a module script, we use the require function. and we will give it a path to our module script. Now, when we do that, we're going to grab this value. The return statement of our module script is going to be what we capture within our windmill config variable right here. So, we can get rid of the speed variable here and we will replace its usage in our heartbeat function with windmill config.speed. We'll run our game again and we'll see that it still works. So, that's good. So once again, let's duplicate our windmill a bunch of times. But this time, if we want to change the speed of the windmills, all we have to do is go to our windmill config and change this value one time. So let's change it to a speed of two to slow it down. And now we see all of our windmills have responded and they're spinning a lot slower. Another really important note about module scripts is that they only get executed one time per environment that they're in. So in this case, we're running everything on the client. And so our module script runs once on the client and then it caches the return value. What that means is that even though we have a bunch of windmills that are requiring this windmill config module, it's only running this code one time and then caching this windmill config value that we're returning. So they all have access to the exact same value. This also means that we can modify this value from another script and all of our windmills will respond accordingly. So for instance, let's create a script within the workspace here and we'll change it to our client run context to match the same context as our windmill. And going back to our spin script, we'll just copy the windmill config and replicated storage lines and paste it into our script here in the workspace. And then let's just create a little loop that every frame sets the windmill config speed value to some noise value. Okay, let's hit play and see what happens. Look at that. We see that the speed of all the windmills is changing and they're all changing in sync because they all share the exact same windmill config table which we're modifying from our script in the workspace. Another use case of module scripts that we see often is to use them as a collection of functions. So for instance, I have a table util module script here that contains a couple functions that I reuse a lot. I have the map function and the filter function. And while the implementations might look a little crazy here with all their types, the important part is that they are stored within a module script. So at any given point in time, I can grab these functions and use them from another script. And that's it for now. If you want to learn more about module scripts, visit the Roblox Creator Hub page and search module scripts to find more documentation on what they are and how they work.", "scraped_at": "2026-01-08T15:05:27.714185", "error": ""}