{"id": "ei2Pc4xV1cQ", "title": "Printing - Roblox Beginners Scripting Tutorial #2 (2025)", "channel": "BrawlDev", "views": 898495, "duration": "9:59", "url": "https://www.youtube.com/watch?v=ei2Pc4xV1cQ", "query": "roblox scripting tutorial", "transcript": "Welcome back to my Roblox beginner scripting tutorial guide. My name is Balddev and in this episode we'll be discussing about printing. So in the last episode we covered the basics of navigating around Roblox Studio and what Roblox Studio has to offer for us that's going to be important for this entire tutorial guide. So for things like moving around inside of Roblox Studio, also showing you the services that Roblox has to offer for us, the explorer panel, and also the properties panel that we're going to be using throughout this entire tutorial guide. Now that we have that understanding, uh, for the rest of this tutorial guide, I'm going to be introducing to you concepts relating to scripting. Now, to basically explain what scripting is, it's an aspect of game development that allows you to add functionality to your games that you're creating on Roblox. So, the other aspects of game development are things like building, like we just did right here. Um, maybe even things like modeling and also, um, UI designing and all of these other sorts of things. Scripting is a component of game development that allows you to add functionality to your game. An example I can think of this is this spawn location right here. So making the spawn location itself requires building. But actually making it functional requires scripting. So if my character were to join into the game, then we need to tell Roblox that we need to spawn on this spawn location. And if our character dies, then we need to respawn back onto this spawn location. that is what adds functionality to the spawn location rather than it just being some random part inside of the game. So that requires scripting to be able to um essentially tell Roblox that we want this uh spawn location to function the way it is because of it. And we add functionality through scripts. Now, to explain what a script is, it's basically a document or a piece of paper that has a list of instructions or commands that basically tells Roblox to execute these commands when we join into the game or when a specific thing happens inside of the game. And so, when we write these scripts, it's very important for us to write it in a very specific way so that Roblox can read these commands and they can interpret it so they can understand it, finally execute them inside of our game. Because this is one of the biggest things new developers get confused with and that is being able to uh get the syntax down like understanding the rules and guidelines when it comes to um writing these commands because they fall under a programming language called Lua or Lua uh for Roblox. And so when we understand this language then we're able to write commands effectively and tell Roblox to execute certain commands within our scripts. So, let's actually create our first script. And we're going to be adding this inside of the explorer. And there's two places that are popular for scripts. The first one is the workspace, and the second one is the server script service. But for this episode, we're going to add a script inside of workspace. And there's there's a couple ways you can add objects inside of a folder. One way is to hit this plus sign that's next to workspace. So, I'm going to click on this, and there should be a list full of all of these um objects that we can put inside of this folder. So, what I'm going to do is say script inside of the search bar. And there's three scripts, but for the sake of this tutorial, we're just going to be using the normal script. So, I'm just going to click on this. And now we have inserted a script inside of our workspace. And you might have also noticed that our screen has changed to be inside of this script editor. And we can revert back to the game if we want to by hitting down this tab right here. So, we are now back into the normal game. And if we want to go back into the script, then we just simply click on the script so that we can pull up the script editor again. And when we open up the script for the first time, Roblox is going to add a default um command here that simply just says print hello world. Now, it might be a little hard to read for you. So, what I want you to do is hit control and then move the mouse scroll wheel inward so that you can zoom in. Um, but I'm already zoomed in pretty well, so if you need to do that, then you can do that very quickly. So for this first scripting episode, what I'm going to show you how to do is write these print statements. Now what is a print statement? A print statement is basically a command that allows us to write a message to an output window so that we can see it uh when we run the game. Now, in order to know where this output window is, what we need to do is go back into the game, hit on the view tab, and we're going to click on this button that says output. So if we click on this then we can see this window down here that shows our um our print statements and also our logs as well. That's the whole point of the output window. It's so that we can see whatever we put inside of here show up down here when we join into the game. So if we go into the game, we can actually test this out for ourselves. The way we do that is by hitting on this test tab up here and then we click on this button that says play. So if we click on this then what's going to happen is first of all our our character actually loads into the game and we can play this game normally as if this was a Roblox game. Um but also down here we can see in the output it says hello world which was our message and we can actually click on um the script that executed this command and it's going to show us the script and also the line of where our print message executed. So this print statement is basically a print command that tells Roblox that we want to print this message down here inside of this output so that we can see it for ourselves. And we can write our own print statements as well um rather than having Roblox's default print message right over here. So what we can do is actually delete this print statement so that we can write our own print statement. So what I'm going to do is hold down the backspace so that it basically deletes all the lines of code that um was over here. So we are on line number one and now let's add in our first print statement. Now one quick thing I want to mention is that when we are writing our scripts it's very case sensitive and what that means is you have to be very specific with how you write stuff inside of the script. So some things can be uppercase, some things can be lowercase. And it's very important that we understand when it is uppercase and when it's lowerase. So now let's write our print statement. We're simply going to say in all lowercase, we're going to say print p r i n t and then what we're going to do is type the open parenthesis. So we're going to press shift 9. And then we're also going to put in the double quotations. So we're going to say shift apostrophe. And so now we can write whatever message we want inside of these quotations. So we can say something as simple as hello just like this with an exclamation mark. And there we go. This is our very first print statement that we have going on right over here. We can test this by going into the game and hitting play. So as we can see in the output, it indeed printed our message with hello. Now, I forgot to mention really quickly that uh when we're playing the game inside of Roblox Studio, like we hit play, uh in order for us to stop play testing, uh we go up here and then just simply hit the stop button. I forgot to mention this because I do it out of instinct. So, I apologize about that. Um so, what we're going to do is hit stop. And now we are back into Roblox Studio. So, now let's go back to our script. And we can actually add more print statements on top of this print statement. So, what we're going to do is drop a line by hitting enter. And as you can see, we are now on line number two. So we can write our print statement just like uh we did the first time by saying print open parenthesis and we're going to say double quotations. And we can continue what we were saying before by saying how are you doing question mark just like this. So now we have two print statements. If we go into the game and hit play, then what we should see in the output is two of our print statements instead of just one. So, it's going to start with hello and then it's going to say how are you doing? So, if we hit stop and then we go into the script, we can continue this chain of print statements if we want to. Uh, we can go and hit enter and then we can write another print statement by saying print open parenthesis double quotations and then I can say I'm doing very well exclamation mark. So now we have three print statements and you can continue going down the script editor and just keep adding more and more print statements if you want to do that. Um because you can make this as long as you want to. Like there's like you have the power to make as many print statements as you want. Like if we go back into the game and hit play then as you can see in the output it's going to display the three print messages that we just created. Now you don't have to worry about the syntax for right now. That's going to be explained in a future episode. But what I want you to do is I literally want you to type exactly what I'm typing here so that you get the feel for knowing how to implement this stuff inside of Roblox Studio and so that you're getting the experience alongside me as we go through these scripting episodes. So that's basically going to be it for this episode. What I want you to do for today's learning objective is to continue this story of like you know these three print statements. You could just continue down here by writing another print statement or if you want you can delete all of these print statements and write your own story or whatever it is you want to create. So you can just delete the entire thing and then you can start back from square one if you want to. It's really up to you with what you want to do. Now, after you do this, what I encourage you to do is take your print statements, go down to the comment section of this video, and then paste it so that other viewers can see um your poem or your message or whatever it is that you're comfortable sharing uh to everybody else because I just think it would be very fun to see what everybody's doing for these challenges. So, go ahead and do that uh once you finish with this learning objective. And one more thing before we end off this video. If you get stuck at any point throughout this tutorial guide, I have a Discord server which you can go into to ask questions and get help for your scripts if you want through the link in the description. So, if you're interested, then feel free to join my Discord server to get help while you go through this tutorial guide. So, that's pretty much going to be it for this tutorial guide. I hope you enjoyed it and I will see you in the next episode. Take care.", "scraped_at": "2026-01-08T15:05:16.565462", "error": ""}