{"id": "GE6Z1n57yDU", "title": "How to ACTUALLY LEARN to Script in Roblox Studio (5 Steps to learn)", "channel": "MikoLikesHat", "views": 389531, "duration": "13:06", "url": "https://www.youtube.com/watch?v=GE6Z1n57yDU", "query": "roblox scripting tutorial", "transcript": "Have you ever wondered why some people learn to script faster than you? They make cool games and you don't because you think you are too dumb. Yeah, me too. Let's get to the point of this video. You've probably been learning to script for months or even years and now you think you're ready to make a game. But when you try to create a game on your own without tutorials or guides, you realize you don't understand everything. You start thinking you've only learned a little and that you need to spend more hours watching tutorials. Well, I don't want to scare you, but you've been learning the wrong way all this time. Let me give you an example. All right, tell me what's your method for learning to script. I know you understand a little about scripting. So, oh, well, look, I started scripting by checking out this uh free model. Then I did a quick search to see what each function does. And then I kept repeating that process until I found some YouTube tutorial. Okay, enough. I get it. Now let me ask you, do you really understand what you're doing when you script? Tell me, is Lua the same as Lu? What is Lua and Lua? Oh god, have you been memorizing everything without actually understanding the concepts behind what you're doing? Yeah, I just write whatever fits the code. Consider yourself lucky again for the fourth time. I'm actually going to teach you how to properly learn to code. Not like those money hungry people who just want to take your money. I know you've already spent a lot of money in the past, so don't fall for that again. If I still don't understand after you teach me, does that mean I'm too dumb? Nah, you just need practice and patience, even if that sounds generic. Hey, welcome to this video. As you probably saw in the title, you might feel like your progress in learning to code is too slow or that you're not actually learning anything. If that's the case, you've found the right video. I'm going to teach you five ways or good practices to actually learn coding without wasting hours watching or reading information that doesn't truly help you improve. Just an important thing, don't blindly follow every instruction or step I show in this video. Everyone has a different learning path. It may be slower or faster, but the point is that by the end of this video, you actually learn something valuable. But before we begin, if you already know a bit about scripting, I also recommend checking out this video. You might be making mistakes without even realizing it. Now, enjoy the video. Before you start, or if you're already learning, you need to understand this concept, which in my opinion is the most important thing you need to know. You don't need to be a tech nerd to understand this. So, I will explain this in the easiest way possible because this may be a little complex for you, especially if it's your first time. Core programming refers to the basic and essential concepts that you need to understand before you start coding or building something. In a few words, they are rules. And if you asking what are these important concepts, let me explain them. The most important ones are problem solving. This is crucial on your journey to becoming a scriptor. You need to know that programming or scripting is about solving problems. Every task and every line of code you write will require you to use your brain. You may think it's like math or building Lego pieces. And yes, you're right. Variables and data types. These little things called variables are really important if you want to store information in your code and also help the machine understand what you're doing. The most common or most used are primitive data types which are number, boolean, string, nil, table, function. Roblox lu also has custom data types like vector 3, frame, instance. These are familiar if you've used other game engines. Conditional logic. This is also important when you're scripting. You want the machine to make decisions based on conditions and the instructions you've given. The most common conditions are if else if. So basically these are the most important concepts in my opinion. With these three steps you can easily understand Lu syntax which is the fundamental structure of the programming language you're learning. I could add more about core programming, but since this is not an advanced tutorial on scripting, these three are enough. You already know what this means, but I'll explain it anyway. On your journey to becoming a scriptor, you must choose the right learning resource to gain experience and knowledge. If you're wondering how many learning resources exist, there are actually a lot. the official Roblox documentation, online courses, YouTube tutorials. Which one should you stick with? In my opinion, if you're a beginner, you should start with YouTube tutorials as a guide. Tutorials help you understand new concepts and get familiar with scripting. But, and this is important, do not rely with tutorials forever. Why? Because, as I mentioned before, problem solving is a crucial skill in coding. Many tutorials walk you through everything step by step, which is fine for learning something new. However, your goal should be to train your brain and improve your problem solving skills. If you keep relying on tutorials, you might end up in something called tutorial hell. And trust me, you don't want to be stuck there. If I stayed in that loop, I wouldn't be making this video in 2025. What about the Roblox documentation? Documentation is also a great way to learn. This is recommended more for intermediate or experienced scriptors. I really, really recommend the Roblox developer hub. Everything you want to know about scripting is there. Even though I am an advanced scriptor, I still use it not to learn but to memorize because sometimes you can forget things. This may look boring to you because there's a lot of text, but trust me, the Roblox documentation is a very good way to learn. and courses. I don't know what to say about them. I watched some courses and uh they're kind of good. I think the main problem is that Roblox scripting courses are usually bad. They are weird at explaining things. Some are overpriced. Many don't offer a challenge to the viewer. Should I recommend it? Maybe if you have extra money, but if I were you, I'd rather spend it on learning another programming language instead. In summary, if you are a beginner, you must use YouTube tutorials as a guide, not a learning resource to gain a lot of experience. And then if you already understand what you are doing and learning, stick with the Roblox documentation or learn Lua. But but tutorials are more fun and some people are so good that they put the code in the comments. I don't understand it, but it works in my game, I think. Avoid those types of tutorials, too. They probably stole it from another talented coder. What? Hear me out. This is the part where I really started to learn how to script and I don't want you to waste a lot of time. So, what do I mean by challenge learning? It's about solving problems. Do you remember that problem solving is really important? Yeah, I've said that like three times. So, how do you apply this then? Pretty easy. Everything you learn from YouTube tutorials, the Roblox documentation, or any learning resource should be applied without memorizing it, by testing your skills. Think of it like a ranked match just with the difference that you actually gain experience instead of just a rank. I will give an example. Noob watches a tutorial about variables and after watching it, he applies what he learned without checking or re-watching the tutorial. He struggles and that's the point. You should struggle. Your brain will be working hard to figure things out. If you get really stuck, you can check the Roblox documentation, but not the video. Oh, did you learn something after uh 6 hours? I was about to hit my head against the table, but actually after experimenting with this, I finally understand how variables work. All right, now repeat this process for the whole month. You've literally learned just 1% of scripting. Good job. I really recommend following this step. It's the most fun and motivating of all the steps I've shown. The satisfaction after working hard and seeing that beautiful code is worth it. Like I said before, you must spend your time challenging yourself. You shouldn't start with your dream game or watch a ton of tutorials thinking you'll automatically learn to script like a machine. Start with small and simple projects. They can be really basic like your own admin commands, a clicker game, parkour mechanics, an interactive NPC system, really anything. The point is to apply everything you've learned throughout your journey. This process needs to be fun and rewarding. The goal of learning is that you shouldn't feel frustrated. If you do, your brain might start to hate scripting, and that's why you never truly learn. I know you need to work really hard because coding isn't easy. But if you enjoy the process, it will be much more effective. Having a positive mindset in any ability you're learning, in this case, scripting. If you ask why you should change your mindset to a positive one, then let me explain. Having a negative mindset, which probably applies to most people watching this video, can be a major setback for your progress. You might start experiencing fear of making mistakes and probably give up on scripting. And that's not something you want. You actually want to learn, right? I used to compare myself to others thinking, why does everyone learn faster than me? Is it because they were born with that talent? I was very, very wrong that day. What you need to know is this. Remind yourself that struggling is normal. I'm not saying you should ignore the bad things. You should improve and learn from them. But while maintaining a positive mindset, of course. As for the benefits of having a positive mindset, there are many. Your motivation boost will be huge and that's the goal. Most people watching this video want to learn to script fast, right? It also reduces frustration, making the learning process more enjoyable, as I mentioned before. So change your mindset. Stop being so negative. Most people don't like being around that mindset. Just be a happy person. Don't pretend to be a happy person anyways. So in conclusion, to summarize all those steps, learn the basics about core programming. You can search it on Google to find out what it actually means and learn it from any learning resource you like. Choose the right learning resource depending on your scripting level and how efficient it is for you. Start making challenges to test your scripting skills. See how much you progress and improve your problem solving skills which are really important. Start with simple and challenging projects to test how you manage making a game by yourself. Don't make it too big. At least something short but fun to test. And the last one, change your mindset to a positive one to boost your learning progress and your mental health. Yes, I care about your mental health. As I said at the start of the video, following these steps in order isn't really necessary. You may have already completed any of these steps without knowing. If you think there's something missing, don't be scared to put it in the comments. Everyone should learn, you know. I don't have much more to say. Thanks for watching this video and see you next time.", "scraped_at": "2026-01-08T15:05:05.271374", "error": ""}