{"id": "PwXHKU4d-PA", "title": "Best BEGINNER GUIDE to Scripting your FIRST Roblox Game!", "channel": "DeHapy", "views": 117152, "duration": "19:10", "url": "https://www.youtube.com/watch?v=PwXHKU4d-PA", "query": "roblox scripting tutorial", "transcript": "all right guys welcome to my first ever scripting lesson if you've watched my previous content you know that I don't typically do educational stuff but today we're going to be trying it out and see how it goes so today I'm going to be showing you guys how to make a button simulator which is the first game that I made that performed really well and it made like 300,000 Roo in total and this is when I was first starting out so it's possible for any of you guys to do for sure so we're going to start off by opening a new base plate in Roblox studio now before we do any scripting or building anything like that we want to go up into game settings and we want to save this game to Roblox and you guys can name it whatever you want for the sake of this I'm just going to name it button simulator demo if you guys hear some banging in the background that's my dad working downstairs ignore that all right so now that the game has been saved to Roblox we can go ahead and open up game settings once again and now we're going to go into security and we will want to enable the requests along with access to API services and then if you guys plan on adding game passes to your game you will want to allow third party sales then you can go ahead and just save it all all right so the first thing we're going to want to do with this project is add a new script to server script service and if you guys do not see this box on the right side go ahead and click on the top view and then enable explore and properties all right so once we have the script open we're we going to go ahead and change the name to leader stats because this is where we're going to be making the stats for the players so where do we start first we want to define the data so where do we start with this well first we want to detect when a player joins the game so that we can give them their data first we have to Define players so let's do local players equals game get service players so what this does is we created a new value by using the local called players and this is the service within Roblox Studio that is already created and now we're going to detect when a player is added to the game so player. player added connect function player so what this does is we got the players from the line that we did before and we're going to detect when a player is added to that list of players and whenever there is a new player added we're going to connect a function and use player as the value for that player who has just been added so if we ever want to modify something about the player we use this term right here so let's go ahead and make a new folder inside of the player where we'll hold all of the stats so let's go ahead and do local leader stats equals instance. new folder and we'll put it inside the player so what this does is just creates a folder and puts the player as the parent and we'll want to give the name to this value so we'll do leader stats. name equals leader stats next we're going to want to go ahead and add the different values that will be in this folder so we'll do local cache equals instance. new folder or actually we'll want to do a number value for this because we'll be changing the value of this and we'll put it inside of the leader stats folder and then we'll give a name for the cache so cash. name equals cach and then if you want to add any more stats you can go ahead and copy this and just change the name here for whatever you want so we'll do multiplier next since that is a common value in a button simulator and then we'll change the name in here to multiplier and now if we go ahead and click play on the top of the screen we should see our stats in the top right corner like you see in most games so we have a value for cash and a value for multiplier but right now none of the stats are changing so let's go ahead and add in a system to gain cash every few seconds so first we're going to want to make a new script and double click on it to open it and we'll want to say game do player player added so the same thing as before and we'll connect another function and we'll do while wait this number right here is how fast you will generate cash so this is going to be every tenth of a second because I have 0.1 if you put one here it'll be wait for 1 second so I'm going to keep it at like 0.2 probably while wait 0.2 do player. leader stats. cache. Value Plus equals 1 so what this does is we get the leader stats value that we put inside of the player in this leader stats script right here and then we got the cash which was located inside the leader stats which we did here and we got the value of that and added one to it so now every fifth of a second we get some cash and it seems to be working well so far it's amazing that I haven't made an error yet I kind of suck at scripting so now we got the cash increasing and we should probably start making the actual buttons because that's the whole point of the game right so let's go ahead and add in a cylinder and we can scale this up a bit this is all of your preference you could use a model from blender to if you'd like we're going to go ahead and just make a folder in the workspace titled buttons then inside of this we'll make another folder for multiplier buttons and let's go ahead and place this inside of that multiplier folder and we'll name it multiplier and for the sake of consistency we'll make make this red like most games have it so now let's go ahead and add a script inside the buttons folder name this button Handler so first we want to get all the buttons in the game right so we'll do local buttons equals script. parent and then get descendants and what this does is we're getting this buttons folder and we're selecting everything under it next we're going to want to get players once again so local players equals game get service player so now this is where it starts to get a little bit more confusing we're going to do a four Loop so four and then underscore comma button and I pairs buttons do so what this does is basically it runs through each descendant within the buttons and it assigns this name to it and then this underscore is just for each thing inside of the folder so we're running the script for every object inside of this folder so now we obviously don't want this script to apply to the script or to the folder so we're going to say if button. name equals multiplier then and you'll want to put a double equals here actually to make sure that it's true and we can change this name to just multiplier now and we'll actually want this in parentheses or not parentheses quotation marks and to test that we found this we're going to do print button found so let's go ahead and test and see if we have it in the output and yes we do we have printed button found if you guys are not able to see the output go ahead and click view on the top of the screen and select output right here all right we're chilling so far this is going well I'm very impressed with myself so now we want this button to actually do something right so let's go ahead and detect when the player steps on the button so we'll do button. touched connect function hit so whenever the button is touched we're connecting a new function and hit is going to be the value of the thing that touched that button so we're going to see if we want to detect if it's actually a player that touched the button and not just another part so we're going to do if hit. parent find first child of class humanoid then so we're seeing if the thing that hit the button has a humanoid within it and that's going to basically detect if it's a player and then we're going to say local player equals players get player from character hit. parent so we're seeing if they have a humanoid then we're going to say that the person who hit the button is player and we're going to say if player then so we're going to make sure we got the player local cache this is where we're going to change the actual stats of the player's values so local Stat or local cach equals player. leer stats. and local multi equals player. leer stats multi all right all right so we've got this and now we want to change the value right so we're going to say multi. Value Plus equals 1 so this is going to basically do multi equals the same value that it was before but adding one so now whenever we step on the button our multiplier should go up by one oh no oh stupid error by me oh we love getting errors we just have to change this instead of multi it's PL multiplier I got lazy so now it should work yes there we go we got a multiplier every time we step on the button but we want to actually have the player purchase the button instead of just getting free stuff from it right so we're going to go ahead and add a value within this button so let search value we'll do a number value and we're going to name this amount this is going to be how much multiplier the player gets from the button and then we'll make another value called cost and this is how much cash the player is going to have to pay to get the button so we'll name this like 25 cash so now what we have to do is we have to check if the player has enough cash to purchase the button so we're going to do if cash. value is greater than or equal to button. amount then cash. value minus equals button. amount and then we can say rebirth. Value Plus equals button dot okay so this should actually be cost cost then this is multiplier I don't know what I'm thinking so now we have to get at least 25 cash you can see it's not working right now oh I see we have to add a value here so cuz we're checking for the actual number within the button not just the variable so now whenever we have over 25 cash it should work yeah there we go all right see I knew I'd be making errors here soon I'm not I'm not that good at scripting I was surprised that I made it that far now whenever we get multiplier our cash is not going up any quicker and typically what we want is the multiplier multiplies the cash hence the name so let's go back into our Cash Generator script and let's change this to plus equal 1 player. leer stats do multiplier Dov value and we'll put this in parenthesis just to avoid any errors so now when we get one multiplier we should gain two cash each tick there we go yep we gain twice as fast now we gain three four five 6 all right perfect now oh what do we do now we've got the basic system down but we only have it for multiplier buttons right and we can now duplicate this button and just change the values inside of it so let's say like we want five multiplier for 200 cash we can do that now but there's no way of telling the actual cost of the buttons or what it giving cuz there's nothing displaying above the button to show that so let's go ahead and add some billboard UI above the button to do this let's go ahead click on the button and add billboard UI then inside this we'll add a frame so for the billboard UI let's go ahead and adjust the position so search for offset studs offset and you'll want to change this middle value so I'm going to set it to like five and then we'll also want to adjust the size let's let's adjust the size to like 0.5 comma 0.5 and then all right that's very small we can change that for sure let's do like five and then three that's a little big all right that works and then the frame inside will change the size to 1 comma 0 comma 1 comma 0 perfect so now let's go ahead and add a text label inside of this Frame we're going to set the Anchor Point to 0.5 comma 0.5 and we'll set the position to 0.5 comma 0 comma 0.25 comma 0 and we'll set the size to 1 comma 0 comma 0.5 comma 0 and we'll change the text to cost or actually we'll we'll change this to amount and we'll change the name of the text label to amount as well then we're going to go ahead and duplicate this by holding contrl D and we'll change the name of this to cost and the position will change the 0.25 to 75 so now we have these two different text labels and for both of these you want the text to be scaled so go ahead and check off this box here all right we're making good progress here so let's go ahead and change the cost text to cost just so we know what each is cost all right all right so now let's go ahead and figure out how to incorporate this into the script so that we can display the cost value and the amount Val value above each of these texts so let's go back into the button Handler script and first off we're going to want to move this button. amount. value and button. Costa value up higher in the script so that we can refer to it earlier so let's go ahead and do it way up here before the buttons even touched we'll do local amount equals button. amount. value and then local cost equals button do cost. value and then we can change each of these to the corresponding value value all right next we can go ahead and do button. billboard ui. amount. text label. text equals amount so what this does if we got all the way down to the text label that we just created oh we don't even need the text label we can just do frame. amount. text so we got billboard UI frame amount and then we get the text of that and we set it to amount and then we'll do button do billboard ui. frame. cost. text equals cost so now when we play we get one multiplier from the button and it costs 25 but it's not pretty obvious to the player what which ones the cost and which ones the amount that you get so let's go ahead and change the colors of these so the text color for the amount is probably going to be red because that is what we are getting from the button the multiplier color is red and then and the cache we'll probably want that to be green oh text color green and that'll make it more obvious so now we see we lose 25 cash and we get one multiplier from it and then also just to make it look better you can go onto the billboard UI and set this light influence all the way to zero when it's at one it'll have a different brightness depending on which way you're facing in relation to the sun but if you set this to zero it'll always just be its brightest and then we can also select each of these frames and just select and set the background transparency to one that way all you see is the text there so now when we play we have a one on top and a 25 on bottom it's looking pretty good so far so now we can go ahead and duplicate this button a few times give it some new values so let's set the amount to like five cost 125 or 150 actually let's do another one let's say we get 10 from this one and and it costs 400 each of these buttons will display their own values now so this one you get one multiplier for 25 cash this one you get five for 150 cash the last one you get 10 for 400 cash pretty simple and you can just do this for as long as you want on an endless line now let's say you want to add in some more values because just having multiplier is a little boring so let's add in a new button we'll name this rebirth and we'll change the color to Blue all right and now let's go ahead and make a new folder inside the buttons folder and we'll name it rebirth perfect so now let's go ahead and change the color on the text to match so we'll change the amount to blue and then cost to Red because we're going to be spending the multiplier to get this button all right so now let's go ahead and add in a new multiplier value into the leader stats so we'll say local rebirth equals instance. new number value number value comma leader stats and then rebirth. name equals rebirth and in this button Handler we're now going to need to change a few things so let's say okay so we have to detect if the button is within the rebirth folder or the multiplier folder so let's do if button. parent. name equals multi then and then we'll move all of this over and then we'll do if button. par. name is equal to rebirth then so then we'll do if if multi. value is greater than or equal to cost then multi. Val gets subtracted by the cost and the rebirth. value is added by one or added by the amount and we haven't defined rebirth yet in this script so let's go ahead and do that local rebirth equals player. leer stats. rebirth and just like that we added a new stat to the game it'll be that simple every time so let's go ahead and play oh we have not set an amount in cost yet for this we're going to go ahead and change this right here on the line five where we check for the button's name we're going to change this to button and we're going to change all of these parts to button just so that we don't have to make a new section for each of the new multipliers button so now it'll go through every button in the game and give them their values so this one will get one rebirth for 25 multiplier so let's go ahead and grind for 25 multiplier all right we have 26 multiplier and now when we step on this we should get one rebirth yes it worked perfect I'm so good at scripting guys I don't know why I ever doubted myself okay so now when we get the rebirth we want to get more multiplier based on how much rebirth we have so let's go ahead and change this spot right here we're going to do we're going to put this into parentheses amount plus rebirth. value okay so now if we save up for more rebirths again we'll get d the amount of multiplier when we get one rebirth so instead of getting one multiplier from this button we'll get two all right so now if we buy Here We step on here you see it goes up by two oh we're getting very quick now this game's getting a little easy might need to make some balance changes but yeah uh that's basically a full button simulator right there obviously it can look prettier but I just speedran this in 30 minutes just to show you guys how to do a little bit of scripting yourselves and yeah if you guys want a better version of this I'll be posting one on shopy happy and I hope you guys all learned something from this anyways I hope you all have a good day thanks for watching and I'll see you in the next one", "scraped_at": "2026-01-08T15:05:11.660124", "error": ""}