{"id": "rP27B7SdTZI", "title": "How to USE the Roblox Documentation to Learn Scripting (How to learn to use it)", "channel": "MikoLikesHat", "views": 9553, "duration": "11:18", "url": "https://www.youtube.com/watch?v=rP27B7SdTZI", "query": "roblox scripting tutorial", "transcript": "And and yeah, what you need for Christine is to read this thing and also copy this thing because it's like magic, you know. And don't forget to check the Roblox documentation, you know. Anyways, don't forget to subscribe and hit the bell. So, I think it's >> Why do these scripting videos always recommend reading the Roblox documentation? It's just a huge mess. I'm not going to read everything that this website has. There's a bunch of stuff I don't understand or that just doesn't make sense to me. Or maybe I just don't know how to read. I don't know. Anyways, this tutorial wasn't great, so I'm going to look for another. >> Relying on tutorials again. Oh god, why is it always the people teaching the wrong way who become famous? You were trying to read the Roblox documentation, right? I'm guessing you either don't know how to read it or you think it's useless. Do you know any documentation whether it's for coding or game engine is a really important part when you're trying to learn any concept? Right. >> I know. I mean I know how a website works. Of course, it's just that I don't want to read everything on that site. And honestly, there's a bunch of useless information, man. I just want a script, you know. >> Oh, well, silly. You don't need to read everything to understand a simple concept. But obviously, you do need to read. What you need to know is which information is actually useful to you and how to search for it. For example, let's say you want to learn about the touched event. Do you know how to find it without getting lost? No. I thought so. >> Well, I guess I rely on tutorials too much. I don't want to stay stuck in this endless learning loop. >> You know what to do. Sit down, focus, and actually pay attention. YouTube. Hey, welcome to this video. As you saw in the title, you want to understand this big document, the Roblox documentation. And honestly, if you ask me, I also didn't see much use in it. Oh god, I was so wrong. So, if you're someone trying to learn how to script or code, this video will definitely help you on your journey. Understanding the Roblox documentation will improve your coding skills, just like it did for me. And seriously, stop relying on bad tutorials. One of the best things about learning from the doc is being upto-date with the information. So if you're someone who still uses weight instead of task weight, well, a little reading won't hurt you. So enjoy this video. Before we start talking about scripting, we need to understand the Roblox documentation. Don't skip this part. Maybe you don't even know what the Roblox documentation is or how it works. Basically, the Roblox documentation is a big guide or book for Roblox Studio in general, not just for scripting. It contains almost everything you need for developing, modeling, monetizing, scripting, building, and a lot more. Anything related to creating a game? Now, you might be asking yourself, why use this if I could just follow Roblox tutorials? Well, the Roblox documentation is very detailed, especially for coding. Instead of relying on outdated tutorials, you get accurate and updated information. That means your game will be more optimized, your code will be better, and of course, if you put the effort, you'll probably impress people enough that they'll hire you for their games. Using this huge resource will make you a better coder. You will spend more time understanding scripts instead of just copying random ones that probably won't work. So yeah, change that mindset of but the Roblox documentation is so boring. I was acting just don't be lazy. Now let's talk about how to actually use it because I haven't explained that yet. I guess you already know how to search a website. Just type Roblox documentation and there it is. Now, when you open it, you'll see a lot of information, but we're not looking for avatars or assets right now. What we need to do is click on the left learn. You'll see a bunch of buttons. Don't get scared. If you're afraid of learning since this is a scripting tutorial, we're going to focus on engine API. If you see this page, congrats. You now know how to access what the Roblox Studio engine has to show to you. But here's the thing. Once you start exploring, especially in classes, you'll see tons of information. Some of it might feel useless. Some of it might be important. Like I said before, we don't want to waste our time reading a bunch of stuff that isn't helpful for you. That's why I always use a strategy to keep things efficient. For example, let's say I want to learn about part.touched. What I do is click on the search icon, type base part.touched, and boom, it takes me straight to the base part page, especially to the touched event. Now you can read for yourself what it does. >> But how do I actually use this as a method to learn scripting? >> Good question. I'll explain that in just a moment. Before we go explaining this, you must already know the basics of scripting like variables, functions, and a basic understanding of coding. If you don't, you may not understand anything in the Roblox stocks. So, I recommend watching my last scripting video or searching for any YouTuber that explains it well. All right, we'll use the touch to vent as an example. The most obvious step is just read. It's too hard to read for you. Once you finish reading the concept about the touch event, you can go into the coding example. Sometimes some documentations don't show the coding example. But that doesn't mean you can't learn. The coding example gives you an idea. But what we want is to learn, not copy the coding and pretend that we learn something. What I did when I was learning to script is this. I analyzed the coding example and I did it my own way. For example, I made this simple script. As you can see, I took everything from the Roblox document and I even used this parameter to know which part was touching. Now, let's try something a little more advanced with services like tween service and you repeat the same process. Read the most important parts of the documentation. But wait, if you see concepts like number, frame, uden, and those things that you may not understand, don't worry. Just click the blue highlight and you can understand by yourself. All right. If you saw the coding example and you still don't understand like the create event, just scroll down until you find create. One of the things I always notice are parameters like I said. And of course, read the description. To make a tween, you need the instance, the tween info, and a dictionary or to make it more understandable, a table. And again, you repeat the same thing with tween info if you don't understand it. With that knowledge and a little idea of code, I can make a tween script by myself. But I always know scripting. So you can see how the part is moving with the tween service. Pretty cool, right? I think at this moment you can get the idea and I hope you actually see the utility of using this document. You don't need to follow the same strategy as me. Read, check code examples and experiment. You may even find a better strategy than mine, but feel free to explore everything that the Roblox document has. Every concept that you want to explore or understand is there. So before we go into the conclusion I want to show you some tricks using the Roblox document while you're using the Roblox docs for example let's say you're searching about run service and you specifically want to learn about heartbeat you can just do this controll + f type heartbeat and there it is you can also try searching Roblox documentation insert what you want to know on Google And most of the time it will show the correct result right at the top and send you directly to the documentation page. Not really important, but I usually see people bookmarking important pages. That way you can return later without needing to search for them again. Well, at this point, you should already know how to use it. Anyways, the Roblox stocks aren't just for scripting. Like I said before, it's actually a huge resource that covers everything about the Roblox Studio Engine in general. If you want to know how to export 3D models, there's a page for that. If you want to know how to monetize your Roblox game, there's also a page for that. You can use the Roblox stocks as a learning resource. Like I've said in many videos, instead of thinking you learned something from a random YouTube tutorial, you can try to learn directly from the source. Some people learn better by reading, others by watching videos. It depends on you. Try both and experiment to see what works best. For me, I said for me personally, reading is better. So, now you already know another Roblox resource for scripting, building, or really anything. Well, I don't have much more to say. Thanks for watching this video, and see you next time.", "scraped_at": "2026-01-08T15:05:13.986782", "error": ""}