{"id": "UE_4mNwcXco", "title": "I Tried Learning Roblox Scripting", "channel": "DeHapy", "views": 147438, "duration": "16:44", "url": "https://www.youtube.com/watch?v=UE_4mNwcXco", "query": "roblox scripting tutorial", "transcript": "This is Billy. And with one simple line of code, I have the ability to set Billy into a glorious fireball of pain and endless suffering. But don't worry, the fire shouldn't actually hurt. Burning Billy is just one of the many things that we'll be coding in today's video because I'm trying to become a procriptor in the next 7 days, and that's a pretty difficult task. But a few days ago, I sent a message to my friend asking if he would be down to coach me, and he said yes. >> What should I even teach you? I don't even know. >> Meet Sub Doggy. What's up, guys? He's one of my friends who's been coding for over four years. And you may recognize him from his own channel where he's made several successful games and got my friend completely hooked on Pogo Sim. >> I can do like the one that I started with, which was a sword fighting game. That was like the first one I made. >> Yeah. After deciding what kind of game we'd be making, I went straight to making the lobby instead of scripting. We got the lobby, we got the spawns, now we need the round system. So, you should add a script in server script service. Okay. Now what we can do in here is create the round system. We just go like while true do and then you got to repeat past that wait until boom. So now this will wait 15 seconds. >> All right. So can you explain what you just did or what? >> Actually let's get the let's make this look better and then we can teleport all the players back. >> Were you following along well there? >> I I think I was. Yeah. >> Now that we finished scripting the round system, it's time to see if what we made actually works. >> Oh my gosh, I have a sword. Oh, I'm going to kill you. Wait, what? >> I won. Let's go. >> Oh, no. Let's go. >> So, in case you couldn't tell, I didn't learn a single thing from that 2hour call. Instead of teaching me how to code, he just spent half the time showing me his unreleased FPS game. And somehow that led to us playing Arsenal. Got you. I killed you. >> I'm thinking we might need to try something different tomorrow. Come on. YES. I can't do this. That looked like a pretty tough fall. Looks like somebody's been trying to learn how to code. How did you find me here? Don't worry, man. This is exactly why I teach people step by step. >> Wait, are you saying you could teach me how to code? >> Oh, of course. I have an online class designed for all ages. By the end, you'll actually have the ability to make a full game on your own. Right when I needed him most, Seal came in clutch and sent me over this beginnerfriendly scripting course that teaches everything you need to know in order to make a Roblox game. Maybe with this course, we actually have a shot at learning how to code. If you want one of these courses for yourself, just go to definitely not seal.com and be sure to use code dehabi when checking out. Now, let's go ahead and open this course. When opening the course, I noticed that each section has a load of lecture videos and ends with a workshop where Seal gives a small coding challenge to complete. So, over the next few days, I'm going to dive into those workshops, test what I learned, and start piecing things together. >> >> All right. So, we just reached the end of the first section. So, it's time to see what our first challenge is. >> So, the goal of this assignment is to make a part that starts to crawl a certain direction based on its size. I'm going to hit run here. And as we can see, this part is moving based on its size. See, now that I've adjusted the size, it scoots 10 studs forward. And it's set to do that multiple times before it ends. See if you can make it. And afterwards, we'll go through and make it together. All right. So, this is the part where we test everything I've learned up to this point. And there's no pressure. It's not like hundreds of thousands of people are going to judge me if I fail. Anyways, I got started by adding a part in the workspace and creating a script in server script service, which is where we're going to be able to code the entire system for this first workshop. And now the system is complete, I think. So, when we press the play button at the top, we should see this part moving every second. And if you look really close, you can see that the part isn't moving at all. If we go ahead and take a look in the output, you can see that there is actually an error, and it seems to be going on in this line. So, I ended up redoing the whole thing, and I found a simpler approach, which actually ended up working really well. But, we still have to test the second half of this project, which is making the part change based on its size. So, as you saw there, I changed the X value, and now it's moving a lot further each tick. And now we have successfully completed our first workshop, which means it's time to move on to workshop number two. >> So with our workshop, we're going to be using our button asset and our lamp asset. When we click this button, our lamp turns on. See if you can write this yourself. >> Wait, that's it? This seems simple enough. The first thing I did was set our project to nighttime. Then I created the simple model for the button with a green part on top. And I set the material to neon so that it glows a bit in this dark map. I ended up doing the same thing for this lamp. Then I turned the transparency down so that it doesn't look like the light is on yet. But we still need the lamp to actually light up the surroundings. So I added a point light. Now we are officially done with creating the models, which means we can finally get to scripting. For the script, I made a simple system that connects a function every time the button is clicked. Within this function, the button turns darker, the lamp gets brighter, and the point light gets enabled. But we still have to see if this actually works by testing the game and clicking on the button. >> >> Welcome to our workshop. The test that I have for you today is a bit of a challenging one. So, I've got two wooden logs here. Wood A, wood B. When you click wood A, it prints wood A's value. If you click wood B, you get wood B's value, which is $25. Let's pause the video here and go ahead and give that a shot. To start off this workshop, I made my own wood A and B models. And within each of these models, I added a touch part with a click detector, which tracks when the player clicks on the part. Now, we just need to add a script and server script service, and we can get straight to creating a simple system to print the values of each wood type in the output. Maybe I should actually explain what my code does. So, here's how all of that looks together. And I hope that made a little bit of sense. So, just like the other workshops, I had to make sure our system actually worked. And from the looks of it, everything seemed to actually work on the first try, which I was not expecting. I ended off the day by completing the final module in our course, and the workshop was actually really boring, so I'm not even going to bother showing it. But, we did complete the full beginner's course. So, now it's time to go off on our own and see what we've actually learned from this. Over the last few days, Seal's course has allowed us to learn more about Roblox scripting than I could have ever imagined. But before we continue on with this challenge, I need to come clean about something. It's been 4 months since my last video. Oops. But don't worry, because I have not been up to nothing. In fact, I've hired a team who's been hard at work helping me bring my dream game to life called Pet Islands. It's been over a year since we started development on this game, and I'm really excited to announce that it's almost ready to be released. So, if you're as excited as I am, be sure to join both the Discord server and Roblox group, which are linked down in the description. And now that you've done that, we can get back to coding our own game. Let's go. For the last week, we've had Definitely Nile right by our side, showing us how everything works. But now, we are completely on our own. Like no one's going to save us if we mess this up. No pressure. Assuming you've watched my previous videos, you'd know I like to challenge myself with small projects that get progressively harder. And what better way to start than by setting something on fire. Let's get started by adding a part in the workspace and adding a proximity prompt so we can interact with it when we're close. And now when we interact with the part, it should change color. In Seal's course, we learned about click detectors, but not proximity prompts. And I can't afford to buy the more advanced course because my wallet's still recovering from buying Moon Animator in the last video, which means we have no choice other than to do things the old-fashioned way. This is the Roblox dev form, a magical place where all of your problems disappear. That's a lie. I just spent 20 minutes getting even more confused about what proximity prompts are. So, we're just going to go with a click detector because that's what I know how to do. After getting the click detector working, I used my incredible VFX skills from a few videos ago to make this amazing fire particle. That's right, I didn't even use the toolbox. After pulling the fire particle from the toolbox, I just had to modify the code to spawn the fire on the part when it's clicked. Why is it not even on the part? What? With the power of editing, the code now magically works. But there is one issue with this code, which is that I can keep clicking the part over and over again, and the fire just keeps getting brighter. What? You thought I was going to fix it. After creating a supernova, I decided to calm down and make a part that just moves back and forth. Since I only bought the beginner's version of Seal's course, I never actually learned how to make a part move. So, I went back over to the dev form, stole some random tween service code that made zero sense to me, and it seems to be working just fine with no issues at all. Turns out I just had to anchor the part so it doesn't randomly fly away. And believe it or not, that took me 30 minutes to figure out. At least it's done now, which means we can move on to the next project, which is a coin collecting system. Before we can make the system to collect coins, we should probably make a way to track how much money the player has, which means I have to add leader stats to my game, which is this little stats thing in the corner you see in most Roblox games. And now with the leader stats in place, I got straight to creating the coin collecting system. And I thought it was going to be simple. You know, the player just touches the coin, it gets deleted, and you get money. But no, instead of deleting the coin, it just spits out a bunch of errors. After figuring out the system for one coin, I made a separate system that works multiple coins at once. I even added this fancy text to show just how filthy rich we are after collecting each coin. >> One eternity later. >> I think I accidentally recreated all of the 2018 speed simulators where some coins are different colors and give you more points. And these points increase your run speed. So, I guess they used to be popular because it takes like zero effort to make. Now that we've accidentally made a speed simulator, it's time to move on to our next project, which is a mining simulator. I figured that one of the essential parts of this is going to be the pickaxe system. So, I imported a pickaxe model from a few years ago and made it a tool that the player can hold. But, we didn't have anything to break yet. So, I added in a few parts that will break when testing, and I put them in a folder named rocks. The reason I put them in this folder is so that the player can't accidentally break the entire map and get stuck in the void. When testing, I ran into this small issue where the rock disappears before the pickaxe even reaches it. Huh? >> So, I added a small delay between when the animation starts and when the rock actually gets destroyed. I felt like I was on fire with this project. It was coming together so quick, but we're still missing a crucial part of the game. In other mining simulators, you start off by mining boring gray rocks like the ones we have right now. But as you progress through the game, you start to find emeralds, rubies, and glowing rainbow blocks worth millions of dollars. This variety helps keep the players online for longer, which ultimately makes the game developers more money, which is exactly why I added it into our game. >> HELLO, I LIKE MONEY. >> After adding a replace part function that picks a random rock and adding an int value into each rock to show how much it's worth, the player's total money now increases based on the rock's value whenever it gets destroyed. And to top everything off, I brought in these beautiful rock models because I was getting sick of the big blocks. And I added this inventory system that shows what ores the player has in a backpack before selling them. But then came the difficult part, selling the ores. I made countless attempts to get this working. I thought maybe it was just a small fix, but everything I did just made it worse. And at this point, I didn't really know what to do. I realized the shop wasn't working because I had all of the stats changing on the client side. instead of the server side. And Seal literally explained this to me in one of his lessons. So now I knew exactly what the issue was. But honestly, I did not have any mental energy left to go through and do all the work of fixing it. So to take a little mental break, I decided to go over to the Discord server and ask you guys for some ideas. Let's see what dumb ideas we have this video. >> Make a game where each click is one stud you can move. Who the would play this? Welcome to my super interactive game where you click a button on the top of your screen and it allows you to run 10 studs. Oh, you run out of studs. Just click the button more and you can keep walking. There's got to be a better idea somewhere in here. Script a hotel bell that explodes if you click it enough. How do you guys even come up with this stuff? All right. Well, I guess we need to start with a bell. And we can't have a bell without sounds. This is perfect. Let's see if it works now. >> >> Why don't you try making an FPS system or you can't do that? >> Wow, I really wasn't expecting to be able to make an FPS this quick. Call me Einstein. >> So, now that my ego is boosted by making those super small projects, it's time to go and make the tycoon. And for this, I decided to go over to YouTube and follow a tutorial >> to create a tycoon on Roblox in 2024. >> I don't know why I thought this would be good content. I just followed exactly what the tutorial said. I set up the plots. I made it so that plots get assigned to players. I made a button that spawns in this rock. I messed around and got stuck in a pile of rocks. I made this cool dropper. Gave it a conveyor. And yeah, that's basically 3 hours summed up in 10 seconds. After finishing the YouTube tutorial, I decided to try and customize it to make a grow a garden tycoon. So, I made a system that has this flower model grow over time, and once it's fully grown, it gets deleted and it drops apart onto the conveyor belt. But, I'm going to be honest, I wasn't really having much fun making a tycoon because I just copied a tutorial and I didn't even learn anything from it. That was such a waste of time. And I know that I said the tycoon would be the final project, but I think I'm actually going to go back to the mining simulator since we left it half complete. After about an hour of off camera work, I finally got the system working the way that I wanted. But when you sell the ores, the inventory UI doesn't exactly update. So, while I just made money, the stone is still in the UI. To fix this, I created a function called clear inventory UI. And the purpose of this function is to clear the inventory UI. Call me Einstein. After getting the clear inventory UI working, I went ahead and added two additional ores to the game, which are going to be iron and diamond. And to add their icons into the inventory, I did my usual process of dragging it into photo peak and adding a black stroke to each image. So now, for example, if we break a diamond ore, it shows up as diamond in our inventory. So now we've completed all of the systems that I would consider necessary for a complete mining simulator. But we still need a map. So, I went over to shopdehappy.com, got this premium nature asset pack, and dragged it straight into my project. Wait, you don't know what Shopyappy is? All right, so this is Billy. Okay, Billy saw this video and decided that he wanted to make his own Roblox game. But when he opened Roblox Studio, he realized, \"Oopsy dupsy, mama poopsy. I don't know what the I'm doing.\" If this sounds like you, you are in luck. Shopy Happy has loads of files that you can simply drag into Roblox Studio and you have a full game. I used the premium asset pack from Shop to Happy and it completely transformed my game. Just look at the results. And if you still don't believe me, meet Darden. He started with one of our packs for just $38 and it led him to make over 10 million Robux. So, if you're interested in capitalizing on this opportunity for yourself, be sure to use code code for 20% off. That's right, the code is code. Let's just get back to work. When building the map, I took the most basic approach possible, which is spamming border parts around the map, adding some decorations around the cell, and filling up every open gap with a bunch of random nature. And just like that, we have something that some people might consider a complete game. But I'm still really happy with how this game turned out because it showed that I'm able to make something complete, even if the bell is my favorite.", "scraped_at": "2026-01-08T15:05:09.909652", "error": ""}